Revit 2027 API
BuiltInFailures.SketchFailures.PathCannotBeClosedLoopPath3d Property
 Path cannot be a closed loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PathCannotBeClosedLoopPath3d { get; }
Public Shared ReadOnly Property PathCannotBeClosedLoopPath3d As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PathCannotBeClosedLoopPath3d {
	FailureDefinitionId^ get ();
}
static member PathCannotBeClosedLoopPath3d : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace